import datetime

import numpy as np
import pandas as pd


def 订单状态表_函数():
    订单表 = pd.read_excel("D:/work/运营/视频号/视频号-MVAV鞋服工厂店/2、清洗后/MVAV鞋服工厂店-视频号-订单表-a-无备注.xlsx",dtype=str)
    订单流水表 = pd.read_excel("D:/work/运营/视频号/视频号-MVAV鞋服工厂店/2、清洗后/MVAV鞋服工厂店-视频号-订单流水表-a-无备注.xlsx",dtype=str)
    仓运单表 = pd.read_excel("D:/work/运营/视频号/视频号-MVAV鞋服工厂店/2、清洗后/MVAV鞋服工厂店-视频号-仓运单表-a-无备注.xlsx",dtype=str)
    售后表 = pd.read_excel("D:/work/运营/视频号/视频号-MVAV鞋服工厂店/2、清洗后/MVAV鞋服工厂店-视频号-售后表-a-无备注.xlsx",dtype=str)

    合并 = pd.merge(订单表, 售后表[["订单编号","退款状态","售后申请时间"]], how='left', left_on='订单号', right_on='订单编号')
    合并 = pd.merge(合并, 订单流水表[["订单号","达人佣金","团长佣金","商家结算时间","实际结算金额","达人名称","团长名称"]], how='left', left_on='订单号', right_on='订单号')
    合并 = pd.merge(合并, 仓运单表[["订单编号","发货时间"]], how='left', left_on='订单号', right_on='订单编号')

    合并["商品价格"] = 合并["商品价格"].astype(float)
    合并["商品数量"] = 合并["商品数量"].astype(float)

    订单状态表 = pd.DataFrame()
    订单状态表["订单编号"] = 合并["订单号"]
    订单状态表["商品单号"] = 合并["订单号"]
    订单状态表["商家编码"] = 合并["商品编码"]
    订单状态表["商品名称"] = 合并["商品名称"]
    订单状态表["成交数量"] = 合并["商品数量"]

    订单状态表["订单应付金额"] = 合并["商品价格"] * 合并["商品数量"]
    订单状态表["订单创建时间"] = 合并["订单创建时间"]
    订单状态表["订单状态"] = 合并["订单状态"]
    订单状态表["售后状态"] = 合并["退款状态"].fillna("-")
    订单状态表["售后申请时间"] = 合并["售后申请时间"].fillna("2000/01/01 00:00")
    订单状态表["实际结算时间"] = 合并["商家结算时间"].fillna("2000-01-01 00:00")
    订单状态表["实际结算时间"] = 订单状态表["实际结算时间"].replace("-","2000-01-01 00:00")
    订单状态表["实际结算金额"] = 合并["实际结算金额"].fillna(0)
    订单状态表["实际结算金额"] = 订单状态表["实际结算金额"].astype(float)

    合并["达人佣金"] = 合并["达人佣金"].fillna(0).astype(float)
    合并["团长佣金"] = 合并["团长佣金"].fillna(0).astype(float)
    订单状态表["预估推广佣金"] = 合并["达人佣金"] + 合并["团长佣金"]
    订单状态表["物流时间"] = 合并["发货时间"].fillna("2000-01-01 00:00:00")

    订单状态表["回退状态"] = "已回"
    订单状态表["回退状态"] = np.where((订单状态表["售后申请时间"] != "2000/01/01 00:00") & (订单状态表["实际结算时间"] == "2000-01-01 00:00"), "已退", 订单状态表["回退状态"])
    订单状态表["回退状态"] = np.where((订单状态表["售后申请时间"] != "2000/01/01 00:00") & (订单状态表["实际结算时间"] != "2000-01-01 00:00"), "回退", 订单状态表["回退状态"])
    订单状态表["回退状态"] = np.where((订单状态表["售后申请时间"] == "2000/01/01 00:00") & (订单状态表["实际结算时间"] == "2000-01-01 00:00"), "待回", 订单状态表["回退状态"])

    订单状态表["统计时间"] = datetime.datetime.now()
    订单状态表[["达人昵称","出单机构"]] = 合并[["达人名称","团长名称"]]
    订单状态表["达人ID"] = ""
    订单状态表["商品单价"] = 合并["商品价格"]
    订单状态表["店铺"] = ""




    订单状态表.to_excel("D:/work/运营/视频号/视频号-MVAV鞋服工厂店/订单状态表.xlsx")



if __name__ == "__main__":
    订单状态表_函数()